app/controllers/users_controller.rb

SELECT `users`.* FROM `users`
---
  def index
    @users = User.all

INSERT INTO `users` (`name`, `email`, `mobile_number`, `created_at`, `updated_at`) VALUES ('ravi ', 'ravi@gmail.com', '08150814628', '2021-05-08 12:30:57', '2021-05-08 12:30:57')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

DELETE FROM `users` WHERE `users`.`id` = 1
---
  def destroy
    @user.destroy

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
    def set_user
      @user = User.find(params[:id])